In [80]:
import numpy as np

In [1]:
from numpy.random import randn as rn

In [2]:
rn(4,3)

array([[-1.4737926 ,  2.09355175,  0.19374707],
       [-0.85035663, -0.08158927, -0.32810742],
       [-1.30464312, -0.61002426,  0.71486584],
       [-0.59587909, -0.99604397, -1.57774725]])

In [3]:
import pandas as pd

In [4]:
pd.DataFrame(rn(4,3))

          0         1         2
0 -1.312575  1.739276  0.659157
1 -0.578732 -0.027983  1.040097
2  0.240544  0.847952 -1.135004
3  0.540932 -1.808067 -0.524471

In [5]:
df = pd.DataFrame(rn(4,3) , index = ['a','b','c','d'],columns =['w','x','y'])
df

          w         x         y
a  0.319834  1.248560 -0.137367
b  0.810172 -1.894512 -0.322845
c  0.053168  1.844752 -0.178589
d -1.108474  1.660261  0.498089

In [6]:
df.iloc[0]  # will extract data ouf of default indices

w    0.319834
x    1.248560
y   -0.137367
Name: a, dtype: float64

In [7]:
df.loc['a']  #named indices

w    0.319834
x    1.248560
y   -0.137367
Name: a, dtype: float64

In [63]:
matrix_data = rn(5,4)
row_labels=['A','B','C','D','E']
column_labels =['W','X','Y','Z']

data = pd.DataFrame(matrix_data,row_labels,column_labels)

In [35]:
data

          W         X         Y         Z
A -0.204747 -1.127458 -1.328032 -0.641855
B  1.388790  0.546321  0.694571 -1.111577
C  1.030075 -0.633769  0.085395 -0.906114
D -1.305214  0.761434 -0.442366 -1.691463
E -1.205884 -0.174467  0.200112 -0.487156

In [28]:
data['S'] = data['X']+data['Y']

In [36]:
data

          W         X         Y         Z
A -0.204747 -1.127458 -1.328032 -0.641855
B  1.388790  0.546321  0.694571 -1.111577
C  1.030075 -0.633769  0.085395 -0.906114
D -1.305214  0.761434 -0.442366 -1.691463
E -1.205884 -0.174467  0.200112 -0.487156

In [30]:
data.drop('Y',axis=1,inplace=True) # for column you have to mention the axis parameter

In [32]:
data.drop('C',inplace=True)

In [37]:
data

          W         X         Y         Z
A -0.204747 -1.127458 -1.328032 -0.641855
B  1.388790  0.546321  0.694571 -1.111577
C  1.030075 -0.633769  0.085395 -0.906114
D -1.305214  0.761434 -0.442366 -1.691463
E -1.205884 -0.174467  0.200112 -0.487156

In [38]:
data.loc['B']

W    1.388790
X    0.546321
Y    0.694571
Z   -1.111577
Name: B, dtype: float64

In [40]:
data.loc[['B','C']]['Z']

B   -1.111577
C   -0.906114
Name: Z, dtype: float64

In [41]:
data.loc[['B','C'] , 'Z']

B   -1.111577
C   -0.906114
Name: Z, dtype: float64

In [42]:
data.loc[['B','C'],['W','Z']]

          W         Z
B  1.388790 -1.111577
C  1.030075 -0.906114

In [43]:
data.iloc[[0,1]]

          W         X         Y         Z
A -0.204747 -1.127458 -1.328032 -0.641855
B  1.388790  0.546321  0.694571 -1.111577

In [47]:
data.iloc[0,2:]

Y   -1.328032
Z   -0.641855
Name: A, dtype: float64

In [48]:
data.iloc[:,2:]

          Y         Z
A -1.328032 -0.641855
B  0.694571 -1.111577
C  0.085395 -0.906114
D -0.442366 -1.691463
E  0.200112 -0.487156

In [49]:
data>True

       W      X      Y      Z
A  False  False  False  False
B   True  False  False  False
C   True  False  False  False
D  False  False  False  False
E  False  False  False  False

In [51]:
data[data>0]

          W         X         Y   Z
A       NaN       NaN       NaN NaN
B  1.388790  0.546321  0.694571 NaN
C  1.030075       NaN  0.085395 NaN
D       NaN  0.761434       NaN NaN
E       NaN       NaN  0.200112 NaN

In [56]:
data[data.loc[['A','B','C']]>0]

          W         X         Y   Z
A       NaN       NaN       NaN NaN
B  1.388790  0.546321  0.694571 NaN
C  1.030075       NaN  0.085395 NaN
D       NaN       NaN       NaN NaN
E       NaN       NaN       NaN NaN

In [64]:
data

          W         X         Y         Z
A  0.391026 -0.504480  1.129202 -0.830193
B -2.113171 -0.440037 -0.460803 -0.551814
C  0.280981 -0.745748 -0.609517 -1.197503
D  0.096997  1.085006 -1.726224  0.983451
E -1.204832 -0.408734 -0.760844 -1.183070

In [65]:
data.reset_index(drop=True,inplace=True)

In [66]:
data

          W         X         Y         Z
0  0.391026 -0.504480  1.129202 -0.830193
1 -2.113171 -0.440037 -0.460803 -0.551814
2  0.280981 -0.745748 -0.609517 -1.197503
3  0.096997  1.085006 -1.726224  0.983451
4 -1.204832 -0.408734 -0.760844 -1.183070

## Multi Leveling Index

In [94]:
outside=['A','A','A','B','B','B']
inside=[1,2,3,1,2,3]

In [95]:
heir = list(zip(outside,inside))

In [96]:
heir

[('A', 1), ('A', 2), ('A', 3), ('B', 1), ('B', 2), ('B', 3)]

In [88]:
heir_df = pd.MultiIndex.from_tuples(heir)

In [97]:
heir_df

MultiIndex([('A', 1),
            ('A', 2),
            ('A', 3),
            ('B', 1),
            ('B', 2),
            ('B', 3)],
           )

In [99]:
df = pd.DataFrame(data=np.round(rn(6,3)),index=heir_df)

In [100]:
df

       0    1    2
A 1 -1.0  1.0 -0.0
  2  1.0 -1.0 -0.0
  3  0.0 -0.0 -0.0
B 1 -1.0  1.0  0.0
  2  1.0 -0.0 -1.0
  3  2.0  1.0  1.0

In [102]:
df.loc['B'].iloc[1:,[0,1]]

     0    1
2  1.0 -0.0
3  2.0  1.0

## Cross Sectional View

In [104]:
outside=['A','A','A','B','B','B']
inside=[1,2,3,1,2,3]
inner=['a','b','c','d','e','f']

In [105]:
index1=list(zip(outside,inside,inner))

In [106]:
multi = pd.DataFrame(data=rn(6,3),index=index1)

In [107]:
multi

                  0         1         2
(A, 1, a)  0.040251  0.536170  2.734175
(A, 2, b) -0.760175  0.256738 -1.541550
(A, 3, c)  0.540862 -0.296082  0.289932
(B, 1, d)  0.330570  1.204751 -0.416075
(B, 2, e) -0.963685  0.187481  0.114778
(B, 3, f)  0.894597  0.188142 -1.493086